In [1]:
import pandas as pd
import numpy as np

In [2]:
score = {'Maths':[76,67,85,93,89], 'Pyhsics':[67,72,81,85,79],'Chemistry':[91,76,83,90,77]}

df_score = pd.DataFrame(score , index=['John','Lily','Chris','Ana','Michael'])
df_score

         Maths  Pyhsics  Chemistry
John        76       67         91
Lily        67       72         76
Chris       85       81         83
Ana         93       85         90
Michael     89       79         77

### Basic Functions

**axes** : Returns a list of the row axis labels

In [4]:
df_score.axes

[Index(['John', 'Lily', 'Chris', 'Ana', 'Michael'], dtype='object'),
 Index(['Maths', 'Pyhsics', 'Chemistry'], dtype='object')]

**dtype** : Returns the dtype of the object.

In [5]:
df_score.dtypes

Maths        int64
Pyhsics      int64
Chemistry    int64
dtype: object

**empty** : Returns True if series is empty.

In [7]:
df_score['Maths'].empty

False

**ndim** : Returns the number of dimensions of the underlying data.

In [8]:
df_score.ndim

2

**size** : Returns the number of elements in the underlying data.

In [9]:
df_score.size #number of data cells in dataframe

15

**values** : Returns the dataframe as ndarray.

In [10]:
df_score.values

array([[76, 67, 91],
       [67, 72, 76],
       [85, 81, 83],
       [93, 85, 90],
       [89, 79, 77]], dtype=int64)

**head()** : Returns the first n rows.

In [11]:
df_score.head(3)   #default value is 5

       Maths  Pyhsics  Chemistry
John      76       67         91
Lily      67       72         76
Chris     85       81         83

**tail()** : Returns the last n rows.

In [13]:
df_score.tail(3)

         Maths  Pyhsics  Chemistry
Chris       85       81         83
Ana         93       85         90
Michael     89       79         77

**shape** : Returns a tuple representing number of rows and columns in DataFrame.

In [14]:
df_score.shape

(5, 3)

### Statistics Functions

In [15]:
df_score

         Maths  Pyhsics  Chemistry
John        76       67         91
Lily        67       72         76
Chris       85       81         83
Ana         93       85         90
Michael     89       79         77

**count()** : number of non-null observations

In [17]:
df_score.count()

Maths        5
Pyhsics      5
Chemistry    5
dtype: int64

**sum()** : Sum of values

In [19]:
df_score.sum()

Maths        410
Pyhsics      384
Chemistry    417
dtype: int64

**mean()** : mean of values

In [21]:
df_score.mean()

Maths        82.0
Pyhsics      76.8
Chemistry    83.4
dtype: float64

**median()** : median of values

In [22]:
df_score.median()

Maths        85.0
Pyhsics      79.0
Chemistry    83.0
dtype: float64

**mode()** : mode of values

In [25]:
df_score.mode()

   Maths  Pyhsics  Chemistry
0     67       67         76
1     76       72         77
2     85       79         83
3     89       81         90
4     93       85         91

**max() / min()** : retrun maximum and minimum values of each column

In [26]:
df_score.max()

Maths        93
Pyhsics      85
Chemistry    91
dtype: int64

In [27]:
df_score.min()

Maths        67
Pyhsics      67
Chemistry    76
dtype: int64

**abs()** : retrun absolute values

In [30]:
ser = [-1,2,-3,4,-5]

df_ser = pd.DataFrame(ser)
df_ser

   0
0 -1
1  2
2 -3
3  4
4 -5

In [31]:
df_ser.abs()

   0
0  1
1  2
2  3
3  4
4  5

**prod()** : retrun product of values

In [34]:
data = {'A':[1,2,3,4], 'B':[5,6,7,8], 'C':[9,10,11,12]}

df_prod = pd.DataFrame(data)
df_prod

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [35]:
df_prod.prod() #product of column values

A       24
B     1680
C    11880
dtype: int64

**cumsum()** : return cumulative sum

In [36]:
df_prod.cumsum()

    A   B   C
0   1   5   9
1   3  11  19
2   6  18  30
3  10  26  42

**cumprod()** : return cumulative product

In [37]:
df_prod.cumprod()

    A     B      C
0   1     5      9
1   2    30     90
2   6   210    990
3  24  1680  11880